# 5.1 Introduction to pandas Data Structures
Two workhorse data structures: DataFrame and Series 
## Series

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series ([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series ([4,7,-5,3], index = ["d","b","c","a"])
obj2

d    4
b    7
c   -5
a    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'c', 'a'], dtype='object')

In [7]:
obj2 ["a"]

np.int64(3)

In [8]:
obj2 ["d"]=6
obj2[["c","a","d"]] # Here ["c","a","d"] is the list of indices

c   -5
a    3
d    6
dtype: int64

In [9]:
# Using Numpy functions such as filtering with a Boolean array, scalar multiplication, or applying math functions, will preserve the index-value link
obj2 [obj2>0]

d    6
b    7
a    3
dtype: int64

In [10]:
obj2*2

d    12
b    14
c   -10
a     6
dtype: int64

In [11]:
np.exp(obj2)

d     403.428793
b    1096.633158
c       0.006738
a      20.085537
dtype: float64

In [12]:
# Another way to think about a Series is as a fixed-length, ordered dictionary, as it is a mapping of index values to data values. 
"b" in obj2

True

In [13]:
"e" in obj2

False

In [14]:
# Once you have data contained in a Python dictionary, you can create a Series from it by passing the dictionary 
sdata = {"Ohio": 35000, "Texas":71000, "Oregon": 16000, "Utah":5000}
obj3 = pd.Series (sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
# A Series can be converted back to a dictionary using to_dict
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
# You can override the order of index in sdata by passing an index with the dictionary keys in the order you want them to be.
states = ["California","Ohio","Oregon","Texas"]
obj4 =pd.Series (sdata, index = states)
obj4
# Notice here the values found in sdata were placed in the appropriate locations.

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [17]:
# .isna and .notna functions in pandas should be used to detect missing data 
pd.isna (obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [18]:
pd.notna (obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [19]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [21]:
# Both the Series object itself and its index have a name attribute, which integrates with other areas of pandas functionality 
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [22]:
obj
obj.index = ["Bob","Leah","Jeff","Kai"]
obj

Bob     4
Leah    7
Jeff   -5
Kai     3
dtype: int64

## DataFrame 
A DataFrame represents a reactangular table of data and contains an ordered, named collection of columns, each of which can be a different data type. The DataFrame has both a row and column index; it can be thought of as a dictionary of Series all sharing the same index. The index is usually the observations and the columns can be seen as variables.

In [23]:
data = {
    "state": ["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
    "year": [2000,2001,2001,2002,2002,2002],
    "pop": [1.5,1.2,1.3,1.5,1.3,1.9]
}
frame =pd.DataFrame (data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.2
2    Ohio  2001  1.3
3  Nevada  2002  1.5
4  Nevada  2002  1.3
5  Nevada  2002  1.9

In [24]:
frame.head ()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.2
2    Ohio  2001  1.3
3  Nevada  2002  1.5
4  Nevada  2002  1.3

In [25]:
frame.tail ()

    state  year  pop
1    Ohio  2001  1.2
2    Ohio  2001  1.3
3  Nevada  2002  1.5
4  Nevada  2002  1.3
5  Nevada  2002  1.9

In [26]:
# If you specify columns, the DataFrame's columns will be arranged in that order 
frame2 = pd.DataFrame (data, columns = ["year","pop","state","debt"])
frame2

   year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.2    Ohio  NaN
2  2001  1.3    Ohio  NaN
3  2002  1.5  Nevada  NaN
4  2002  1.3  Nevada  NaN
5  2002  1.9  Nevada  NaN

In [27]:
frame2.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [28]:
frame2 ["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [29]:
frame2.year

0    2000
1    2001
2    2001
3    2002
4    2002
5    2002
Name: year, dtype: int64

In [30]:
frame2.year.index

RangeIndex(start=0, stop=6, step=1)

In [31]:
frame2.loc [1]

year     2001
pop       1.2
state    Ohio
debt      NaN
Name: 1, dtype: object

In [32]:
frame2 ["debt"]=12.2
frame2

   year  pop   state  debt
0  2000  1.5    Ohio  12.2
1  2001  1.2    Ohio  12.2
2  2001  1.3    Ohio  12.2
3  2002  1.5  Nevada  12.2
4  2002  1.3  Nevada  12.2
5  2002  1.9  Nevada  12.2

In [33]:
frame2 ["debt"]= np.arange (6.0)
frame2

   year  pop   state  debt
0  2000  1.5    Ohio   0.0
1  2001  1.2    Ohio   1.0
2  2001  1.3    Ohio   2.0
3  2002  1.5  Nevada   3.0
4  2002  1.3  Nevada   4.0
5  2002  1.9  Nevada   5.0

In [34]:
frame2 ["eastern"]= frame2 ["state"]=="Ohio"
frame2

   year  pop   state  debt  eastern
0  2000  1.5    Ohio   0.0     True
1  2001  1.2    Ohio   1.0     True
2  2001  1.3    Ohio   2.0     True
3  2002  1.5  Nevada   3.0    False
4  2002  1.3  Nevada   4.0    False
5  2002  1.9  Nevada   5.0    False

In [35]:
# del is a method to delete column 
del frame2 ["eastern"]
frame2.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [36]:
frame2.T # allows you transform the rows with the columns

          0     1     2       3       4       5
year   2000  2001  2001    2002    2002    2002
pop     1.5   1.2   1.3     1.5     1.3     1.9
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
debt    0.0   1.0   2.0     3.0     4.0     5.0

In [37]:
# Another common form of data is nested dictionary of dictionaries: 
populations = {
    "Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, 
    "Nevada": {2001: 2.4, 2002: 2.9}
    
}
frame3 = pd.DataFrame (populations, index =[2001,2002,2003])
frame3

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [38]:
pdata = {
    "Ohio": frame3 ["Ohio"][:-1],
    "Nevada": frame3 ["Nevada"][:2]
}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [39]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2001    1.7     2.4
2002    3.6     2.9
2003    NaN     NaN

In [40]:
# Unlike Series, DataFrame does not have a name attribute. DataFrame's to_numpy method returns the data contained in the DataFrame as a two-dimensional ndarry
frame3.to_numpy ()

array([[1.7, 2.4],
       [3.6, 2.9],
       [nan, nan]])

In [41]:
frame2.to_numpy()

array([[2000, 1.5, 'Ohio', 0.0],
       [2001, 1.2, 'Ohio', 1.0],
       [2001, 1.3, 'Ohio', 2.0],
       [2002, 1.5, 'Nevada', 3.0],
       [2002, 1.3, 'Nevada', 4.0],
       [2002, 1.9, 'Nevada', 5.0]], dtype=object)

In [42]:
obj = pd.Series (np.arange(3),index = ["a","b","c"])
index =obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [43]:
# Index objects are immutable and thus cannot be modified by the user
# index [1]="d" causes an error
# Immutability makes it safer to share index objects among data structures

In [44]:
labels = pd.Index (np.arange (3))
labels

Index([0, 1, 2], dtype='int64')

In [45]:
obj2 =pd.Series ([1.4,2.2,0], index = labels )
obj2

0    1.4
1    2.2
2    0.0
dtype: float64

In [46]:
obj2.index is labels

True

In [47]:
frame3

state  Ohio  Nevada
year
2001    1.7     2.4
2002    3.6     2.9
2003    NaN     NaN

In [48]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [49]:
"Ohio" in frame3.columns

True

In [50]:
2003 in frame3.index

True

In [51]:
# a pandas index can contain duplicate labels 
pd.Index (["too","too"])
# Selection with duplicate labels will select all occurrences of that label

Index(['too', 'too'], dtype='object')

## 5.2 Essential Functionality 
### Reindexing

In [52]:
obj = pd.Series ([4.5,7.2,-5.3,3.6], index = ["d","b","a","c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [53]:
obj2 = obj.reindex (["a","b","c","d","e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [54]:
# For ordered data like time series, you may want to do some interpolation or filling of values when reindexing.
obj3 = pd.Series (["blue","purple","yellow"], index = [0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [55]:
obj3.reindex (np.arange (6),method = "ffill") # ffill is a method that forward fills the value

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [56]:
frame = pd.DataFrame (np.arange (9).reshape ((3,3)), 
                      index = ["a","c","d"],
                      columns = ["Ohio","Texas","California"]
                     )
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [57]:
frame2 = frame.reindex (["a","b","c","d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [58]:
states = ["Texas","Utah","California"]
frame3 = frame.reindex (columns =states)
frame3

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [59]:
# Another way to reindex a particular axis is to pass the new axis labels as a positional argument and then specify the axis to reindex with the axis keyword
frame.reindex (states, axis ="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [60]:
# You can also use loc to reindex columns or rows, but this only works when all of your new labels have already existed. 
frame.loc [["a","d","c"],["California","Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

### Dropping Entries from an Axis

In [61]:
obj =pd.Series (np.arange(5.),index = ["a","b","c","d","e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [62]:
new_obj = obj.drop ("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [63]:
obj.drop (["d","c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [64]:
data = pd.DataFrame (np.arange (16).reshape ((4,4)),
                     index = ["Ohio","Colorado","Utah","New York"],
                     columns = ["one","two","three","four"]
                    )
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
# Calling drop with a sequence of labels will drop values from the row labels 
data.drop (index = ["Colorado","Utah"])

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [66]:
data.drop (columns = ["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [67]:
data.drop ("two",axis =1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [68]:
data.drop(["two","four"],axis = "columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, Selecting, and Filtering

In [69]:
obj = pd.Series (np.arange (4.),index =["a","b","c","d"])
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [70]:
# Use loc
obj.loc [["b","c"]]

b    1.0
c    2.0
dtype: float64

In [71]:
# Assigning values using these methods modifies the corresponding section of the Series
obj.loc [["b","c"]]=5

In [72]:
# loc: indexing with label, iloc: indexing wiht integers 
obj.iloc[[0,1,2]]

a    0.0
b    5.0
c    5.0
dtype: float64

In [73]:
data = pd.DataFrame (np.arange (16).reshape ((4,4)),
                     index = ["Ohio","Colorado","Utah","New York"],
                     columns =["one","two","three","four"]
                    )
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data ["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [75]:
data[["three","one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [76]:

data [:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [77]:
data [data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [78]:
# Another use case is indexing with a Boolean DataFrame, such as one produced by a scalar comparision.
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [79]:
data [data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [80]:
data.loc ["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [81]:
data.loc[["Colorado","New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [82]:
# You can combine both row and column selection using loc 
data.loc ["Colorado",["two","three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [83]:
# Use iloc on integers 
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [84]:
data.iloc [:,:3][data.three >5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [85]:
#! Boolean arrays can be used with loc but not iloc
data.loc [data.three>=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Arithmetic and Data Alignment

In [86]:
# When you add objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs
s1 = pd.Series ([7.3,-2.5,3.4,1.5,2.2], index = ["a","b","c","d","e"])
s2 = pd.Series ([-2.1,3.6,-1.5,4,3.1], index = ["a","c","e","f","g"])
s1+s2
# In the case of DataFrame, alignment is performed on both rows and columns

a    5.2
b    NaN
c    7.0
d    NaN
e    0.7
f    NaN
g    NaN
dtype: float64

In [87]:
s1.add(s2,fill_value =0) #This method substitutes the passed value for any missing values in the operation

a    5.2
b   -2.5
c    7.0
d    1.5
e    0.7
f    4.0
g    3.1
dtype: float64

## Funtion Application and Mapping

In [90]:
frame = pd.DataFrame (np.random.standard_normal ((4,3)),
                     columns = list ("bde"),
                     index = ["Utah","Ohio","Texas","Oregon"])
frame

               b         d         e
Utah    1.095084 -0.882306  0.484024
Ohio   -0.604008  0.726386 -1.039426
Texas  -0.901280 -0.794542  0.621988
Oregon -1.642173 -0.502380 -0.087081

In [91]:
np.abs(frame)

               b         d         e
Utah    1.095084  0.882306  0.484024
Ohio    0.604008  0.726386  1.039426
Texas   0.901280  0.794542  0.621988
Oregon  1.642173  0.502380  0.087081

In [92]:
def f1(x):
    return x.max ()-x.min ()

frame.apply (f1)

b    2.737257
d    1.608692
e    1.661414
dtype: float64

In [93]:
frame.apply (f1, axis = "columns") # apply across columns

Utah      1.977390
Ohio      1.765812
Texas     1.523268
Oregon    1.555091
dtype: float64

In [98]:
# function returns a Series 
def f2 (x):
    return pd.Series ([x.min (), x.max ()], index = ["min","max"])
frame.apply(f2)

            b         d         e
min -1.642173 -0.882306 -1.039426
max  1.095084  0.726386  0.621988

## Sorting and Ranking
sort_index

In [99]:
obj = pd.Series (np.arange (4), index = ["d","a","b","c"]
    )
obj

d    0
a    1
b    2
c    3
dtype: int64

In [100]:
obj.sort_index () # To sort lexicographically by row or column label

a    1
b    2
c    3
d    0
dtype: int64

In [102]:
frame = pd.DataFrame ( np.arange (8).reshape ((2,4)),
                       index = ["three","one"],
                       columns = ["d","a","b","c"]
    
)
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [103]:
frame.sort_index ()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [106]:
frame.sort_index (axis = "columns").sort_index ()

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [107]:
frame.sort_index (ascending = False )

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [110]:
# To sort a Series by its value, it is sort_values methdo 
obj = pd.Series ([1,3,1.5,-3])
obj

0    1.0
1    3.0
2    1.5
3   -3.0
dtype: float64

In [111]:
obj.sort_values ()

3   -3.0
0    1.0
2    1.5
1    3.0
dtype: float64

In [112]:
obj.sort_values (ascending = False )

1    3.0
2    1.5
0    1.0
3   -3.0
dtype: float64

In [114]:
# Any missing value will be sorted to the end by default 
obj1 = pd.Series ([1,3,1.5,-3,np.nan,1])
obj1

0    1.0
1    3.0
2    1.5
3   -3.0
4    NaN
5    1.0
dtype: float64

In [115]:
obj1.sort_values ()

3   -3.0
0    1.0
5    1.0
2    1.5
1    3.0
4    NaN
dtype: float64

In [116]:
obj1.sort_values (na_position = "first") # Missing values can be sorted to the start using na_position

4    NaN
3   -3.0
0    1.0
5    1.0
2    1.5
1    3.0
dtype: float64

In [118]:
# When sorting a DataFrame, you can use the data in one or more columns as the sort keys. To do so, pass one or more column names to sort_values

frame = pd.DataFrame ({"b":[4,7,-3,2],
                       "a": [0,1,0,1]
                      })
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [119]:
frame.sort_values ("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [120]:
frame.sort_values (["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

## Axis Indexes with Duplicate Labels

In [121]:
obj = pd.Series ( np.arange (5),
                  index = ["a","a","b","c","d"]
           
)
obj

a    0
a    1
b    2
c    3
d    4
dtype: int64

In [122]:
# The is_unique property can tell you whether or not its index is unique 
obj.index.is_unique

False

## Summarizing and Computing Descriptive Statistics

In [124]:
df = pd.DataFrame (
    [[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],
    index = list ("abcd"),
    columns = ["one","two"]
)
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [125]:
df.sum ()

one    9.25
two   -5.80
dtype: float64

In [126]:
df.sum (axis = "columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

## Unique Values, Value Counts, and Membership

In [127]:
obj = pd.Series (["c","a","c","a"])

In [129]:
uniques = obj.unique ()
uniques

array(['c', 'a'], dtype=object)

In [130]:
obj.value_counts ()

c    2
a    2
Name: count, dtype: int64

In [131]:
# isin performs a vectorized set membership check and can be useful in filtering a dataset down to a subset of values in a Series or column in a DataFrame:
obj

0    c
1    a
2    c
3    a
dtype: object

In [133]:
mask = obj.isin (["b","c"])
mask

0     True
1    False
2     True
3    False
dtype: bool

In [134]:
obj[mask]

0    c
2    c
dtype: object